nxp-mcuxpresso/mcux-sdk/devices/MK27FA15/MK27FA15.h
/*! @name HWGENERAL - General Hardware Parameters Register */
/*! @{ */
#define USBHS_HWGENERAL_PHYW_MASK                (0x30U)
#define USBHS_HWGENERAL_PHYW_SHIFT               (4U)
/*! PHYW - PHY Width
 *  0b01..16 bit wide data bus
 */
#define USBHS_HWGENERAL_PHYW(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_PHYW_SHIFT)) & USBHS_HWGENERAL_PHYW_MASK)
#define USBHS_HWGENERAL_PHYM_MASK                (0x1C0U)
#define USBHS_HWGENERAL_PHYM_SHIFT               (6U)
/*! PHYM - PHY Mode
 *  0b000..Controller configured for UTMI/UTMI+ interface.
 */
#define USBHS_HWGENERAL_PHYM(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_PHYM_SHIFT)) & USBHS_HWGENERAL_PHYM_MASK)
#define USBHS_HWGENERAL_SM_MASK                  (0x600U)
#define USBHS_HWGENERAL_SM_SHIFT                 (9U)
/*! SM - Serial mode
 *  0b00..No Serial Engine, always use parallel signaling.
 */
#define USBHS_HWGENERAL_SM(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWGENERAL_SM_SHIFT)) & USBHS_HWGENERAL_SM_MASK)
/*! @} */

/*! @name HWHOST - Host Hardware Parameters Register */
/*! @{ */
#define USBHS_HWHOST_HC_MASK                     (0x1U)
#define USBHS_HWHOST_HC_SHIFT                    (0U)
#define USBHS_HWHOST_HC(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_HWHOST_HC_SHIFT)) & USBHS_HWHOST_HC_MASK)
#define USBHS_HWHOST_NPORT_MASK                  (0xEU)
#define USBHS_HWHOST_NPORT_SHIFT                 (1U)
#define USBHS_HWHOST_NPORT(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWHOST_NPORT_SHIFT)) & USBHS_HWHOST_NPORT_MASK)
#define USBHS_HWHOST_TTASY_MASK                  (0xFF0000U)
#define USBHS_HWHOST_TTASY_SHIFT                 (16U)
#define USBHS_HWHOST_TTASY(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWHOST_TTASY_SHIFT)) & USBHS_HWHOST_TTASY_MASK)
#define USBHS_HWHOST_TTPER_MASK                  (0xFF000000U)
#define USBHS_HWHOST_TTPER_SHIFT                 (24U)
#define USBHS_HWHOST_TTPER(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWHOST_TTPER_SHIFT)) & USBHS_HWHOST_TTPER_MASK)
/*! @} */

/*! @name HWDEVICE - Device Hardware Parameters Register */
/*! @{ */
#define USBHS_HWDEVICE_DC_MASK                   (0x1U)
#define USBHS_HWDEVICE_DC_SHIFT                  (0U)
#define USBHS_HWDEVICE_DC(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_HWDEVICE_DC_SHIFT)) & USBHS_HWDEVICE_DC_MASK)
#define USBHS_HWDEVICE_DEVEP_MASK                (0x3EU)
#define USBHS_HWDEVICE_DEVEP_SHIFT               (1U)
#define USBHS_HWDEVICE_DEVEP(x)                  (((uint32_t)(((uint32_t)(x)) << USBHS_HWDEVICE_DEVEP_SHIFT)) & USBHS_HWDEVICE_DEVEP_MASK)
/*! @} */

/*! @name HWTXBUF - Transmit Buffer Hardware Parameters Register */
/*! @{ */
#define USBHS_HWTXBUF_TXBURST_MASK               (0xFFU)
#define USBHS_HWTXBUF_TXBURST_SHIFT              (0U)
#define USBHS_HWTXBUF_TXBURST(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_HWTXBUF_TXBURST_SHIFT)) & USBHS_HWTXBUF_TXBURST_MASK)
#define USBHS_HWTXBUF_TXADD_MASK                 (0xFF00U)
#define USBHS_HWTXBUF_TXADD_SHIFT                (8U)
#define USBHS_HWTXBUF_TXADD(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_HWTXBUF_TXADD_SHIFT)) & USBHS_HWTXBUF_TXADD_MASK)
#define USBHS_HWTXBUF_TXCHANADD_MASK             (0xFF0000U)
#define USBHS_HWTXBUF_TXCHANADD_SHIFT            (16U)
#define USBHS_HWTXBUF_TXCHANADD(x)               (((uint32_t)(((uint32_t)(x)) << USBHS_HWTXBUF_TXCHANADD_SHIFT)) & USBHS_HWTXBUF_TXCHANADD_MASK)
#define USBHS_HWTXBUF_TXLC_MASK                  (0x80000000U)
#define USBHS_HWTXBUF_TXLC_SHIFT                 (31U)
/*! TXLC - Transmit local Context Registers
 *  0b0..Store device transmit contexts in the TX FIFO
 *  0b1..Store device transmit contexts in a register file
 */
#define USBHS_HWTXBUF_TXLC(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_HWTXBUF_TXLC_SHIFT)) & USBHS_HWTXBUF_TXLC_MASK)
/*! @} */

/*! @name HWRXBUF - Receive Buffer Hardware Parameters Register */
/*! @{ */
#define USBHS_HWRXBUF_RXBURST_MASK               (0xFFU)
#define USBHS_HWRXBUF_RXBURST_SHIFT              (0U)
#define USBHS_HWRXBUF_RXBURST(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_HWRXBUF_RXBURST_SHIFT)) & USBHS_HWRXBUF_RXBURST_MASK)
#define USBHS_HWRXBUF_RXADD_MASK                 (0xFF00U)
#define USBHS_HWRXBUF_RXADD_SHIFT                (8U)
#define USBHS_HWRXBUF_RXADD(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_HWRXBUF_RXADD_SHIFT)) & USBHS_HWRXBUF_RXADD_MASK)
/*! @} */

/*! @name GPTIMER0LD - General Purpose Timer n Load Register */
/*! @{ */
#define USBHS_GPTIMER0LD_GPTLD_MASK              (0xFFFFFFU)
#define USBHS_GPTIMER0LD_GPTLD_SHIFT             (0U)
#define USBHS_GPTIMER0LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0LD_GPTLD_SHIFT)) & USBHS_GPTIMER0LD_GPTLD_MASK)
/*! @} */

/*! @name GPTIMER0CTL - General Purpose Timer n Control Register */
/*! @{ */
#define USBHS_GPTIMER0CTL_GPTCNT_MASK            (0xFFFFFFU)
#define USBHS_GPTIMER0CTL_GPTCNT_SHIFT           (0U)
#define USBHS_GPTIMER0CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTL_GPTCNT_SHIFT)) & USBHS_GPTIMER0CTL_GPTCNT_MASK)
#define USBHS_GPTIMER0CTL_MODE_MASK              (0x1000000U)
#define USBHS_GPTIMER0CTL_MODE_SHIFT             (24U)
/*! MODE - Timer Mode
 *  0b0..One shot
 *  0b1..Repeat
 */
#define USBHS_GPTIMER0CTL_MODE(x)                (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTL_MODE_SHIFT)) & USBHS_GPTIMER0CTL_MODE_MASK)
#define USBHS_GPTIMER0CTL_RST_MASK               (0x40000000U)
#define USBHS_GPTIMER0CTL_RST_SHIFT              (30U)
/*! RST - Timer Reset
 *  0b0..No action
 *  0b1..Load counter value
 */
#define USBHS_GPTIMER0CTL_RST(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTL_RST_SHIFT)) & USBHS_GPTIMER0CTL_RST_MASK)
#define USBHS_GPTIMER0CTL_RUN_MASK               (0x80000000U)
#define USBHS_GPTIMER0CTL_RUN_SHIFT              (31U)
/*! RUN - Timer Run
 *  0b0..Timer stop
 *  0b1..Timer run
 */
#define USBHS_GPTIMER0CTL_RUN(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER0CTL_RUN_SHIFT)) & USBHS_GPTIMER0CTL_RUN_MASK)
/*! @} */

/*! @name GPTIMER1LD - General Purpose Timer n Load Register */
/*! @{ */
#define USBHS_GPTIMER1LD_GPTLD_MASK              (0xFFFFFFU)
#define USBHS_GPTIMER1LD_GPTLD_SHIFT             (0U)
#define USBHS_GPTIMER1LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER1LD_GPTLD_SHIFT)) & USBHS_GPTIMER1LD_GPTLD_MASK)
/*! @} */

/*! @name GPTIMER1CTL - General Purpose Timer n Control Register */
/*! @{ */
#define USBHS_GPTIMER1CTL_GPTCNT_MASK            (0xFFFFFFU)
#define USBHS_GPTIMER1CTL_GPTCNT_SHIFT           (0U)
#define USBHS_GPTIMER1CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER1CTL_GPTCNT_SHIFT)) & USBHS_GPTIMER1CTL_GPTCNT_MASK)
#define USBHS_GPTIMER1CTL_MODE_MASK              (0x1000000U)
#define USBHS_GPTIMER1CTL_MODE_SHIFT             (24U)
/*! MODE - Timer Mode
 *  0b0..One shot
 *  0b1..Repeat
 */
#define USBHS_GPTIMER1CTL_MODE(x)                (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER1CTL_MODE_SHIFT)) & USBHS_GPTIMER1CTL_MODE_MASK)
#define USBHS_GPTIMER1CTL_RST_MASK               (0x40000000U)
#define USBHS_GPTIMER1CTL_RST_SHIFT              (30U)
/*! RST - Timer Reset
 *  0b0..No action
 *  0b1..Load counter value
 */
#define USBHS_GPTIMER1CTL_RST(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER1CTL_RST_SHIFT)) & USBHS_GPTIMER1CTL_RST_MASK)
#define USBHS_GPTIMER1CTL_RUN_MASK               (0x80000000U)
#define USBHS_GPTIMER1CTL_RUN_SHIFT              (31U)
/*! RUN - Timer Run
 *  0b0..Timer stop
 *  0b1..Timer run
 */
#define USBHS_GPTIMER1CTL_RUN(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_GPTIMER1CTL_RUN_SHIFT)) & USBHS_GPTIMER1CTL_RUN_MASK)
/*! @} */

/*! @name USB_SBUSCFG - System Bus Interface Configuration Register */
/*! @{ */
#define USBHS_USB_SBUSCFG_BURSTMODE_MASK         (0x7U)
#define USBHS_USB_SBUSCFG_BURSTMODE_SHIFT        (0U)
/*! BURSTMODE - Burst mode
 *  0b000..INCR burst of unspecified length
 *  0b001..INCR4, non-multiple transfers of INCR4 is decomposed into singles.
 *  0b010..INCR8, non-multiple transfers of INCR8, is decomposed into INCR4 or singles.
 *  0b011..INCR16, non-multiple transfers of INCR16, is decomposed into INCR8, INCR4 or singles.
 *  0b100..Reserved, do not use.
 *  0b101..INCR4, non-multiple transfers of INCR4 is decomposed into smaller unspecified length bursts.
 *  0b110..INCR8, non-multiple transfers of INCR8 is decomposed into smaller unspecified length bursts.
 *  0b111..INCR16, non-multiple transfers of INCR16 is decomposed into smaller unspecified length bursts.
 */
#define USBHS_USB_SBUSCFG_BURSTMODE(x)           (((uint32_t)(((uint32_t)(x)) << USBHS_USB_SBUSCFG_BURSTMODE_SHIFT)) & USBHS_USB_SBUSCFG_BURSTMODE_MASK)
/*! @} */

/*! @name HCIVERSION - Host Controller Interface Version and Capability Registers Length Register */
/*! @{ */
#define USBHS_HCIVERSION_CAPLENGTH_MASK          (0xFFU)
#define USBHS_HCIVERSION_CAPLENGTH_SHIFT         (0U)
#define USBHS_HCIVERSION_CAPLENGTH(x)            (((uint32_t)(((uint32_t)(x)) << USBHS_HCIVERSION_CAPLENGTH_SHIFT)) & USBHS_HCIVERSION_CAPLENGTH_MASK)
#define USBHS_HCIVERSION_HCIVERSION_MASK         (0xFFFF0000U)
#define USBHS_HCIVERSION_HCIVERSION_SHIFT        (16U)
#define USBHS_HCIVERSION_HCIVERSION(x)           (((uint32_t)(((uint32_t)(x)) << USBHS_HCIVERSION_HCIVERSION_SHIFT)) & USBHS_HCIVERSION_HCIVERSION_MASK)
/*! @} */

